content/blog/h/rbooks.org
:PROPERTIES:
:ID:       uu37kln02wj0
:ROAM_ALIASES: rbook
:END:
#+title: Reading List
#+OPTIONS: toc:t
#+OPTIONS: broken-links:mark


Please note: These are neither the books I recommend nor the ones I agree with
their ideologies; the but a list of the documents/textbooks that I own, with
some notes of (as a review) that could be helpful to anyone in the future, thus,
this list proudly contains horribly written books.

*IMPORTANT: If you are looking for a reading list for reading recommendation, see [[id:p6s5gi81a3k0][Reading
List (for others)]] or [[id:omy9ejo02wj0][Bibliography]]*

*IMPORTANT: categories are totally messed up here*.


* Canceled
- Of Popes and Unicorns: Science, Christianity, and How the Conflict Thesis Fooled the World
- Writing with Style: Conversations on the Art of Writing
- Qaddafi and the United States Since 1969 by Edward P. Haley
- Orientalism - Macfie, Alexander Lyon

* Later
* History
:PROPERTIES:
:CUSTOM_ID: history
:END:
** Middle East/ Ummah
- Social Origins of Dictatorship and Democracy: Lord and Peasant in the Making of the Modern World
- Beyond Chutzpah: On the Misuse of Anti-Semitism and the Abuse of History
- The Intellectual Life (Sertillanges, A)
- _Egypt (Springborg, R)_
- _Infidels (Wheatcroft, A)_[fn:5]
- تاريخ تونس (الهادي، م)
- Zarathustra's Secret (Köhler, J)
- الحرب العراقية-الإيرانية (القصاب، ع)
- المقاومة (مروة، ك)
- الحرب القذرة (سويدية، ح
- الجزائر إلى أين (مجموعة باحثين)
- إيران: الثورة الخفية (كوفيل، ت)

  I think I need a better set of book on Iran history.
- Great Myths of the Brain (Jarrett, C)
- موسوعة تاريخ أوروبا (الزيدي، م)
- تاريخ أوروبا في العصور الوسطى (بيشوب، م)
- تاريخ مصر القومي، (الرفاعي، ع)
- المشروع الصهيوني وبداية الوعي العربي لمخاطره (الشلبي، س)
- استعمار مصر (ميشيل، ت)
- _الفكر المصري في القرن الثامن عشر بين الجمود والتجديد (العزباوي، ع_)
- الإسلاميون والقضية الفلسطينية (موسى، ب)
- ليبيا (بازامه، م)
- قصة الثورة الإيرانية (ذبيح، س)
- تشكيل الأجنحة السياسية في إيران (برزين، س)
- A History of Modern Iran (Abrahamian, E)
- الانتقال من الثورة إلى الدولة[fn:82]
- نقد الثورة المصرية
- الثورة المستمرة
- حول العرب والعروبة
- قصة تونس من البداية
- عن الحرية (زكي نجيب محمود)
- How the West Stole Democracy from the Arabs[fn:51]
- تاريخ إيران السياسي بين ثورتين
- إفريقيا جنوب الصحراء (زبادية)
- التراث الشعبي والشعر الملحون بالجزائر
- دور استراتيجة المقاومة الإسلامية[fn:69]
- Mecca of Revolution[fn:72]
- Berber Government[fn:73]
- Markets of Civilization [fn:28]
- الصراع على الخليج العربي[fn:74]
- محاضرات في تاريخ الجزائر[fn:70]
- قضايا ودراسات في تاريخ الجزائر[fn:71]
- تاريخ الثقافة في ليبيا[fn:77]
- الدولة والمسألة الثقافية في الجزائر
- _الدولة والمسألة الثقافية في تونس_
- _الدولة والمسألة الثقافية في المغرب_
- البعث السوري (تاريخ موجز)
- موقف الاقباط من الحكم الاسلامي
- مُوجز لتاريخ الشيوعية
- Anarchism (Ward)
- Ancient Warfare (Sidebottom)
- The Birth of The Clinic (Foucault)
- لبنان (بيضون)
- لبنان بين الطوائف (عساف)
- لبنان تاريخه وتراثه
- مسارات مفكر عربي (محمد الشيخ)
- تاريخ الشيوعية في الشرق الأوسط
- تسلف الأخوان
- Inheriting Syria
- All the Shah's Men
- George Lincoln Rockwell
- معجم ما ألف في فضائل وتاريخ المسجد الأقصى والقدس وفلسطين ومدنها
** Ancient World
- المدن الفينيقية (مهران)
- المدن الكبرى (مهران)
- بنو إسرائيل(مهران)
- تاريخ العراق القديم (مهران)
- دراسات في تاريخ العرب (مهران)
- دليل مصطلحات ثورة التحرير الجزائرية (مرتاض، ع)

** Crusades

- What were the Crusades? (Riley-Smith)
- Crusades (Jonathan Riley-Smith)
- الأيام الحاسمة في الحروب الصليبية
** Rome and Ancient Europe
- الإمبراطورية الرومانية (لورو)
- Europe: A History (Norman Davies)
- A Brief History of the Romans (Oxford)
- The Early History of Rome (Livy)
- The Twelve Caesars (Suctonius)
- Metamorphose (Ovid)
- The Aeneid (Virgil)
- The Jewish Wars (Josephus)
- Rubicon: The Last Years of the Roman Republic

