content/blog/h/rbooks.org
* Marxism

- The Society of the Spectacle (Debord)
- كارل ماركس (برلين)
- مختارات لينين
- مدخل إلى علم السياسية (لاسكي)
- +ماركس ضد نيتشه+
- History and Class Consciousness
- The Theory of the Novel
- الماركسية اللينينية ونظرية الحزب
- +Islam and Capitalism+
- النشاط الجنسي وصراع الطبقات
- متى يطلع الفجر؟ (جان بول أوليفييه)
- ثورة الزنج
- الماركسيون والدين (فيريه)
- النشاط الجنسي وصراع الطبقات
- نظام العمل المأجور (أنجلس)
- عرض موجز للماركسية
- الصراع الأمريكي السوفياتي في الشرق الأوسط
- اطروحات الماركسية حول العولمة
- في تمرحل التاريخ
- مقدمات نظرية: لدراسة أثر الفكر الاشتراكي في حركة التحرر الوطني
- الاستعمار الجديد (غوامي نكروما)
- Marxism and Nationalism (Vanaik)
- ثورة مصر والصراع الطبقي المفتوح
- دفاعًا عن الماركسية (كورنفورث)
- حول مسائل مرحلة الإنتقال من الرأسمالية الى الأشتراكية و دكتاتورية البروليتاريا
- Dialectical and Historical Materialism (Stalin)
- ألف باء شيوعية
- الماركسية الصحيحة (لوكاش)
- التاريخ والوعي الطبقي (لوكاش)
- State and Revolution (Lenin)
- The Ego and his Own (Stirner)
- الفكر الحقوقي البرجوازي (تومانوف، ف)
** Struggle

- دور العنف (إنجلز)
- النبي المسلح
- الماركسية وحرب العصابات
- كيف تصنع ete ناجحًا
- تجارب ست ثورات عالمية
- الماركسية وحرب العصابات
** Hardcore Capitalism
- الكتاب الأسود للرأسمالية
- الطب الإمبريالي
- أوروبا والتخلف في أفريقيا
- أمبراطورية الإرهاب [fn:50]
- المثقفون المزيفون (باسكال بونيفاس)
- ما بعد الرأسمالية المتهالكة
- الاستعمار الجديد (جاك وودس)
- Canada in Africa (Engler)
- الإرهاب المعولم
- The Protestant Ethic and the Spirit of Capitalism
- Canada in Africa 300 Years of Aid and Exploitation
- Why Liberalism Failed (Daneen)
- American War Machine (Scott)
- Provincialization and Class Struggle in Africa
- _الرأسمالية والفصام_
*** Authors                                                           :noexport:
-  Immanuel Wallerstein
- Galal Amin
- Samir Amin
* ʿAqīdah
- قراءة جديدة لحروب الردة
- كتب العلوين المقدسة
- مجموعة الأحاديث العلوية
- المهدية في الاسلام (محمد حسن)
- اخوان الصفا (عمر الدسوقي)
- المناظرات والردود العلوية
- ملخص تاريخ الخوارج (محمد شريف سليم)
- العقل في المجتمع العراقي (شاكر شاهين)
- رسائل الحكمة العلوية
- فرق الشيعة المتطرفين (جابر عبدالعال)
- الميثولوجيا عند العرب قبل الإسلام (سليم الحوت)
- الهداية الكبرى (الحسين بن حمدان الخصيبي)
- الحجة والدليل في نصر الدين الذليل
- الحكمة السومرية في العراق القديم (قاشا)
- المعتزلة (قاشا)
- اليزيدية (الديوه جي)
- اليزيدية (سعيد سمو)
- اليزيدية (صديق الدملوجي)
- وحدة الوجود العقلية (الوائلي)
- عقائد الباطنية (الهادي الطاهري)
- المذاهب في العراق (الخيون)
- الدرزية (نسيب مكارم)
- عقائد الشيعة الاثني عشرية (جنوف)
- شعر الأسماعيلية (عامر البصري)
- المُخلص (الناصر صديقي[fn:8])
- المعتزلة والثورة (عمارة)
- نقد الخطاب السلفي (السمهوري)
- المعتزلة ثورة الفكر الاسلامي الحر
- The Monks of War (Desmond Seward)
- God's Philosophers (Hannam)
- Doubt (Hecht)
- Life After Death (Segal)
- Rome's Gothic Wars (Kulikowski)
- Rubicon (Holland)
- Life in a Medieval City (Gies)
- Life in a Medieval Village (Gies)
- Cathedral, Forge, and Waterwheel (Gies)
- Evicted From Eternity (Herzfeld)
- أضواء على السنة المحمدية (أبو زهرة)
- فتح المضيرة (أبو زهرة)
- العدالة الاجتماعية في الإسلام (قطب)
- شروط النهضة (مالك بن نبي)
- مشكلة الأفكار في العالم الإسلامي (مالك بن نبي)
- معاوية (العقاد)
- الإسلام والاستبداد السياسي (محمد الغزالي)
- ماذا خسر العالم بانحطاط المسلمين (الندوي)
- المذاهب التفسيرية عند الشيعة والسنة
- براءة الأشعريين من عقائد المخالفين
- الصواعق الإلهية
- كشف الارتياب في أتباع محمد بن عبد الوهاب
- كتاب الأشاعرة في ميزان أهل السنة
- الفكر الشيعي المبكر
- كلمات قصر لعلي بن أبي طالب
- الرد على المتعصب العنيد المانع من ذم يزيد
- الأباضية عقيدة ومذهبة
- الدروز (أوبنهايم)
- السيرة النبوية (مهران)
- الإمام علي (مهران)
- الإمامة (مهران)
- العروة الوثقى (محمد عبده)
- معجم المؤلفات الاسلامية[fn:68]
- الفرق الصوفية في الإسلام[fn:75]
- الإباضية بين الفرق الإسلامية
- الخوارج (عبد الكريم عقل)
- عصر الخلافة الراشدة[fn:79]
- تطهير الجنان واللسان[fn:80]
- الإجابة[fn:81]
- وحدة الوجود العقلية
- نحو انقاذ التاريخ الإسلامي
- ملخص تاريخ الخوارج
- ملحم شكر[fn:84]
- كيف تسللت الليبرالية
- ماذا خسر العالم بانحطاط المسلمين
- الغلو في مصطلح الملل والنحل والرجال
- تيارات الفكر الإسلامي (محمد عمارة)
- القول الواجبب (الهندي)
- أزمة أفريقية الاقتصادية في الإسلام
- Christianity/Islam (Schoun)
- النصوص (الآقادادي)
- مناهج علماء المسلمين في البحث العلمي
- الإسلام على مفترق الطرق
- الإسلام (عبد القادر عودة)
- الإسلام يتحدى (وحيد الدين)
- التجديد والتحريم والتأويل
- الخطاب والتأويل
- النص، السلطة، الحقيقة
- نقد الخطاب الديني
- الديمقراطية في الإسلام
- المسألة اليهودية (حسين)
- محنة الإسلام الكبرى (طه بدر)
- السلطة في الإسلام (عبدالجواد ياسين)
* Democracy
- _ديموقراطيات في خطر (ألفريد ستبيان)_
- الديموقراطية ونقادها (دال)
- _الديموقراطية: أبحاث مختارة (لاري دايموند)_
- _عالم بلا قانون (فيليب ساندز)_
- _موت الديموقراطية (هث)_
- الديموقراطية الإله الذي فشل (هوبا)
* History of Mathematics

# This is a VERY good idea, I would understand math much worse if i hadn't read
# about where the concepts came from and what problems led to developing them
# further. Read the books by William Dunham, especially Journey through Genius.
# Men of Mathematics by Bell is a good classic with biographies of major
# mathematicians. Overall best is probably Stillwell's Mathematics and its
# History, which will also teach you real math from basically all fields.  Another
# one you might want to check out is Mathematics: Its Content, Methods and Meaning
# by a team of soviet authors. Not historical but a great overview.

- Journey through Genius
- Men of Mathematics
- Mathematics and its history
- Mathematics: Its Content, Methods and Meaning

- How to Prove It (Velleman)
- Elements of Set Theory (Enderton)
- Foundation of Analysis (Landau)
- Basic Mathematics (Lang)
- Principle of Mathematics (Oakley)
- Transition to Advanced Mathematics
- Calclus (Spivak)

* Greek
- Ancient Greece[fn:19]
- Bibliotheca (Apollodorus)
- The Iliad, The Odyssy (Alexander Pope's Translation)
- Works and Days (Theogony)
- The Histories (Herodotus)

