static/~saleh/rbooks.html
<div id="outline-container-org09c5f25" class="outline-2">
<h2 id="org09c5f25">Marxism</h2>
<div class="outline-text-2" id="text-org09c5f25">
<ul class="org-ul">
<li>The Society of the Spectacle (Debord)</li>
<li>كارل ماركس (برلين)</li>
<li>مختارات لينين</li>
<li>مدخل إلى علم السياسية (لاسكي)</li>
<li><del>ماركس ضد نيتشه</del></li>
<li>History and Class Consciousness</li>
<li>The Theory of the Novel</li>
<li>الماركسية اللينينية ونظرية الحزب</li>
<li><del>Islam and Capitalism</del></li>
<li>النشاط الجنسي وصراع الطبقات</li>
<li>متى يطلع الفجر؟ (جان بول أوليفييه)</li>
<li>ثورة الزنج</li>
<li>الماركسيون والدين (فيريه)</li>
<li>النشاط الجنسي وصراع الطبقات</li>
<li>نظام العمل المأجور (أنجلس)</li>
<li>عرض موجز للماركسية</li>
<li>الصراع الأمريكي السوفياتي في الشرق الأوسط</li>
<li>اطروحات الماركسية حول العولمة</li>
<li>في تمرحل التاريخ</li>
<li>مقدمات نظرية: لدراسة أثر الفكر الاشتراكي في حركة التحرر الوطني</li>
<li>الاستعمار الجديد (غوامي نكروما)</li>
<li>Marxism and Nationalism (Vanaik)</li>
<li>ثورة مصر والصراع الطبقي المفتوح</li>
<li>دفاعًا عن الماركسية (كورنفورث)</li>
<li>حول مسائل مرحلة الإنتقال من الرأسمالية الى الأشتراكية و دكتاتورية البروليتاريا</li>
<li>Dialectical and Historical Materialism (Stalin)</li>
<li>ألف باء شيوعية</li>
<li>الماركسية الصحيحة (لوكاش)</li>
<li>التاريخ والوعي الطبقي (لوكاش)</li>
<li>State and Revolution (Lenin)</li>
<li>The Ego and his Own (Stirner)</li>
<li>الفكر الحقوقي البرجوازي (تومانوف، ف)</li>
</ul>
</div>
<div id="outline-container-orga77f0d1" class="outline-3">
<h3 id="orga77f0d1">Struggle</h3>
<div class="outline-text-3" id="text-orga77f0d1">
<ul class="org-ul">
<li>دور العنف (إنجلز)</li>
<li>النبي المسلح</li>
<li>الماركسية وحرب العصابات</li>
<li>كيف تصنع ete ناجحًا</li>
<li>تجارب ست ثورات عالمية</li>
<li>الماركسية وحرب العصابات</li>
</ul>
</div>
</div>
<div id="outline-container-org04bcc17" class="outline-3">
<h3 id="org04bcc17">Hardcore Capitalism</h3>
<div class="outline-text-3" id="text-org04bcc17">
<ul class="org-ul">
<li>الكتاب الأسود للرأسمالية</li>
<li>الطب الإمبريالي</li>
<li>أوروبا والتخلف في أفريقيا</li>
<li>أمبراطورية الإرهاب <label for="40" class="margin-toggle sidenote-number"></label><input type="checkbox" id="40" class="margin-toggle"/><span class="sidenote">
السياسة الأميركية العابرة للقارات في الأمن والاقتصاد ومكافحة الإرهاب
</span></li>
<li>المثقفون المزيفون (باسكال بونيفاس)</li>
<li>ما بعد الرأسمالية المتهالكة</li>
<li>الاستعمار الجديد (جاك وودس)</li>
<li>Canada in Africa (Engler)</li>
<li>الإرهاب المعولم</li>
<li>The Protestant Ethic and the Spirit of Capitalism</li>
<li>Canada in Africa 300 Years of Aid and Exploitation</li>
<li>Why Liberalism Failed (Daneen)</li>
<li>American War Machine (Scott)</li>
<li>Provincialization and Class Struggle in Africa</li>
<li><span class="underline">الرأسمالية والفصام</span></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3e27554" class="outline-2">
<h2 id="org3e27554">ʿAqīdah</h2>
<div class="outline-text-2" id="text-org3e27554">
<ul class="org-ul">
<li>قراءة جديدة لحروب الردة</li>
<li>كتب العلوين المقدسة</li>
<li>مجموعة الأحاديث العلوية</li>
<li>المهدية في الاسلام (محمد حسن)</li>
<li>اخوان الصفا (عمر الدسوقي)</li>
<li>المناظرات والردود العلوية</li>
<li>ملخص تاريخ الخوارج (محمد شريف سليم)</li>
<li>العقل في المجتمع العراقي (شاكر شاهين)</li>
<li>رسائل الحكمة العلوية</li>
<li>فرق الشيعة المتطرفين (جابر عبدالعال)</li>
<li>الميثولوجيا عند العرب قبل الإسلام (سليم الحوت)</li>
<li>الهداية الكبرى (الحسين بن حمدان الخصيبي)</li>
<li>الحجة والدليل في نصر الدين الذليل</li>
<li>الحكمة السومرية في العراق القديم (قاشا)</li>
<li>المعتزلة (قاشا)</li>
<li>اليزيدية (الديوه جي)</li>
<li>اليزيدية (سعيد سمو)</li>
<li>اليزيدية (صديق الدملوجي)</li>
<li>وحدة الوجود العقلية (الوائلي)</li>
<li>عقائد الباطنية (الهادي الطاهري)</li>
<li>المذاهب في العراق (الخيون)</li>
<li>الدرزية (نسيب مكارم)</li>
<li>عقائد الشيعة الاثني عشرية (جنوف)</li>
<li>شعر الأسماعيلية (عامر البصري)</li>
<li>المُخلص (الناصر صديقي<label for="41" class="margin-toggle sidenote-number"></label><input type="checkbox" id="41" class="margin-toggle"/><span class="sidenote">
بحث في الفكر المهدوي
</span>)</li>
<li>المعتزلة والثورة (عمارة)</li>
<li>نقد الخطاب السلفي (السمهوري)</li>
<li>المعتزلة ثورة الفكر الاسلامي الحر</li>
<li>The Monks of War (Desmond Seward)</li>
<li>God&rsquo;s Philosophers (Hannam)</li>
<li>Doubt (Hecht)</li>
<li>Life After Death (Segal)</li>
<li>Rome&rsquo;s Gothic Wars (Kulikowski)</li>
<li>Rubicon (Holland)</li>
<li>Life in a Medieval City (Gies)</li>
<li>Life in a Medieval Village (Gies)</li>
<li>Cathedral, Forge, and Waterwheel (Gies)</li>
<li>Evicted From Eternity (Herzfeld)</li>
<li>أضواء على السنة المحمدية (أبو زهرة)</li>
<li>فتح المضيرة (أبو زهرة)</li>
<li>العدالة الاجتماعية في الإسلام (قطب)</li>
<li>شروط النهضة (مالك بن نبي)</li>
<li>مشكلة الأفكار في العالم الإسلامي (مالك بن نبي)</li>
<li>معاوية (العقاد)</li>
<li>الإسلام والاستبداد السياسي (محمد الغزالي)</li>
<li>ماذا خسر العالم بانحطاط المسلمين (الندوي)</li>
<li>المذاهب التفسيرية عند الشيعة والسنة</li>
<li>براءة الأشعريين من عقائد المخالفين</li>
<li>الصواعق الإلهية</li>
<li>كشف الارتياب في أتباع محمد بن عبد الوهاب</li>
<li>كتاب الأشاعرة في ميزان أهل السنة</li>
<li>الفكر الشيعي المبكر</li>
<li>كلمات قصر لعلي بن أبي طالب</li>
<li>الرد على المتعصب العنيد المانع من ذم يزيد</li>
<li>الأباضية عقيدة ومذهبة</li>
<li>الدروز (أوبنهايم)</li>
<li>السيرة النبوية (مهران)</li>
<li>الإمام علي (مهران)</li>
<li>الإمامة (مهران)</li>
<li>العروة الوثقى (محمد عبده)</li>
<li>معجم المؤلفات الاسلامية<label for="42" class="margin-toggle sidenote-number"></label><input type="checkbox" id="42" class="margin-toggle"/><span class="sidenote">
في الرد على الفرق الوهابية
</span></li>
<li>الفرق الصوفية في الإسلام<label for="43" class="margin-toggle sidenote-number"></label><input type="checkbox" id="43" class="margin-toggle"/><span class="sidenote">
ترمنجهام
</span></li>
<li>الإباضية بين الفرق الإسلامية</li>
<li>الخوارج (عبد الكريم عقل)</li>
<li>عصر الخلافة الراشدة<label for="44" class="margin-toggle sidenote-number"></label><input type="checkbox" id="44" class="margin-toggle"/><span class="sidenote">
أكرم ضياء العمري
</span></li>
<li>تطهير الجنان واللسان<label for="45" class="margin-toggle sidenote-number"></label><input type="checkbox" id="45" class="margin-toggle"/><span class="sidenote">
ابن حجر الهيثمي
</span></li>
<li>الإجابة<label for="46" class="margin-toggle sidenote-number"></label><input type="checkbox" id="46" class="margin-toggle"/><span class="sidenote">
فيما استدركته عائشة على الصحابة
</span></li>
<li>وحدة الوجود العقلية</li>
<li>نحو انقاذ التاريخ الإسلامي</li>
<li>ملخص تاريخ الخوارج</li>
<li>ملحم شكر<label for="47" class="margin-toggle sidenote-number"></label><input type="checkbox" id="47" class="margin-toggle"/><span class="sidenote">
أضواء على الصابئين
</span></li>
<li>كيف تسللت الليبرالية</li>
<li>ماذا خسر العالم بانحطاط المسلمين</li>
<li>الغلو في مصطلح الملل والنحل والرجال</li>
<li>تيارات الفكر الإسلامي (محمد عمارة)</li>
<li>القول الواجبب (الهندي)</li>
<li>أزمة أفريقية الاقتصادية في الإسلام</li>
<li>Christianity/Islam (Schoun)</li>
<li>النصوص (الآقادادي)</li>
<li>مناهج علماء المسلمين في البحث العلمي</li>
<li>الإسلام على مفترق الطرق</li>
<li>الإسلام (عبد القادر عودة)</li>
<li>الإسلام يتحدى (وحيد الدين)</li>
<li>التجديد والتحريم والتأويل</li>
<li>الخطاب والتأويل</li>
<li>النص، السلطة، الحقيقة</li>
<li>نقد الخطاب الديني</li>
<li>الديمقراطية في الإسلام</li>
<li>المسألة اليهودية (حسين)</li>
<li>محنة الإسلام الكبرى (طه بدر)</li>
<li>السلطة في الإسلام (عبدالجواد ياسين)</li>
</ul>
</div>
</div>
<div id="outline-container-orga353ad5" class="outline-2">
<h2 id="orga353ad5">Democracy</h2>
<div class="outline-text-2" id="text-orga353ad5">
<ul class="org-ul">
<li><span class="underline">ديموقراطيات في خطر (ألفريد ستبيان)</span></li>
<li>الديموقراطية ونقادها (دال)</li>
<li><span class="underline">الديموقراطية: أبحاث مختارة (لاري دايموند)</span></li>
<li><span class="underline">عالم بلا قانون (فيليب ساندز)</span></li>
<li><span class="underline">موت الديموقراطية (هث)</span></li>
<li>الديموقراطية الإله الذي فشل (هوبا)</li>
</ul>
</div>
</div>
<div id="outline-container-orgacf3379" class="outline-2">
<h2 id="orgacf3379">History of Mathematics</h2>
<div class="outline-text-2" id="text-orgacf3379">
<ul class="org-ul">
<li>Journey through Genius</li>
<li>Men of Mathematics</li>
<li>Mathematics and its history</li>
<li>Mathematics: Its Content, Methods and Meaning</li>

<li>How to Prove It (Velleman)</li>
<li>Elements of Set Theory (Enderton)</li>
<li>Foundation of Analysis (Landau)</li>
<li>Basic Mathematics (Lang)</li>
<li>Principle of Mathematics (Oakley)</li>
<li>Transition to Advanced Mathematics</li>
<li>Calclus (Spivak)</li>
</ul>
</div>
</div>
<div id="outline-container-org960590d" class="outline-2">
<h2 id="org960590d">Greek</h2>
<div class="outline-text-2" id="text-org960590d">
<ul class="org-ul">
<li>Ancient Greece<label for="48" class="margin-toggle sidenote-number"></label><input type="checkbox" id="48" class="margin-toggle"/><span class="sidenote">
A political, social, and cultural history
</span></li>
<li>Bibliotheca (Apollodorus)</li>
<li>The Iliad, The Odyssy (Alexander Pope&rsquo;s Translation)</li>
<li>Works and Days (Theogony)</li>
<li>The Histories (Herodotus)</li>
</ul>
</div>
</div>
