content/blog/h/rbooks.org
** On The Zionism Movement and The Israeli Occupation in Palestine
- Ethnocracy (Yifachel)
- Language They Understand (Thrall)
- Invention of Ancient Israel
- Gaza in Crisis (Chomsky)
- اتفاق أوسلو وتداعياته
- الفكر السياسي الفلسطيني 1964-1974
- حول التناقض والممارسة في الثورة الفلسطينية]]
- ما بعد الصهيونية ومستقبل المجتمع الإسرائيلي
- الاقتصاد السياسي لصناعة التقنية العالية في اسرائيل
- استراتيجية التحرير الكامل واستراتيجية الحل السياسي
- الهيكل التنظيمي للانتفاضة وأساليب العمل ربعي المهدون
- شبهات حول الثورة الفلسطينية
- الصهيونية غير اليهودية
** Authors                                                            :noexport:
- Jean-Pierre Filiu
* Misc Authors
- Antony C. Sutton
- Immanuel Wallerstein
- Gustave Doré
- Dante Alighieri
- Walter Rodney
* Poetry
- +The Canteos (Pound)+
- Collected Poems (Kipling)
- Collected Poems (T.S. Eliot)
- Complete Poetry (William Bake)
- The Unfortunates (Bear)
* Politics
- _Propaganda and the Public Mind (Chomsky)_
- The Protestant Ethic (Weber)
- The New Age of Empire (Andrews)
- Anarchism (Guerin)
- Postcapitalist Desire (Fisher)
- The Myth of Religious Violence
- The Great Delusion (John Mearsheimer)
- The Fourth Political Theory
- Biology as ideology (Lewontin)
- Political Psychology (Houghton)
- How Democracies Die (Levitsky)
- The Year 501
- Soft Power (Nye)
- How Fascism Works (Stanley)
- Desert (Anonymous)
- العلمانية الجزئية والعلمانية الشاملة
- الدين والعلمانية في سياق تاريخي
- أميركا والإبادات الجماعية
- فخ النيوليبرالية في دول الخليج
- الطريق إلى التطرف
- المثقفون العرب والتراث
- المدينة الإسلامية والأصولية والإرهاب
- Occupy (Chomsky)
- Perilous Power[fn:25] (Chomsky)
- Hegemony or Survival (Chomsky)
- Imperial Ambitions (Chomsky)
- Pirates and Emperors (Chomsky)
- The Leaderless Revolution (Ross)
- The China Model[fn:60]
- The Impossible State[fn:61]
- تفكيك الإشتراكية العربية
- جذور العنصرية العربية
- لماذا نكره الإسلام السياسي
- Global Culture (Featherstone)
- Rogue States (Chomsky)
- النبوءة والسياسة
- طريق الحرير (فرانكوبان، ب)
- Nervous States: Democracy and the Decline of Reason (Davies, W)
* Science-related
- Fossils (Thomson)
- The Behaviour of the Domestic Cat
- In Defence of Dogs (Bradshaw)
- The Domestic Cat (Bateson)
- كيف ينتشر السلوك؟
- The Mismeasure of Man[fn:78]
- علم النفس مذهبًا (فيتز، ب)
* Chess
- Amateur to IM (Hawkins)
- Chess for Zebras (Rowson)
- Chess Fundamentals (Capablanca)
- Judgement and Planning in Chess (Euwe)
- Winning with Chess Psychology
- Think Like a Grandmaster (Kotov)
- Understanding Chess Endgames
* Heritage
- تاريخ الحسين
- حديقة الحقيقة
- تاريخ الزركلي
- وفيات الأعيان
- تاريخ الرسول والملوك
- تاريخ الإسلام
- الكامل في التريخ
- الطبقات الكبير
- سير أعلام النبلاء
- مرآة الزمان في تاريخ الأعيان
- البستان الجامع
- التاريخ المعتبر
* Aesthetics
- _Culture and Value (Wittgenstein)_
- _Esoterism as Principle and as Way_
- شرح نهج البلاغة
- الدر الفريد
- The Flinch (Smith)
- Wisdom for the Soul
- التذكرة
- قصص العرب
- نفح الطيب من غصن الأندلس الرطيب
- مقامات الحريري
- قول على قول
- حلية الأولياء
- Joseph de Maistre
- Alberto Moravia
- Ismail Kadare
- Ivan Turgenev
- Jonathan Swift
* Literature

- The Illuminatus! Trilogy (Wilson, R. and Shea, R.)
- Confession (Gorky, M.)
- Death with Interruptions (Saramago, J.)
- Perfume: The Story of a Murderer (Suskind, P.)
- Prljave ruke (Kazantzakis, N.)
- Christ Recrucified (Kazantzakis, N.)
- Nausea (Sartre, J.-P.)
- Growth of the Soil (Hamsun)
- جناح السرطان (سولجينيتسين، أ.)
- Confessions of a Mask (Mishima, Y.)
- A Hero of Our Time (Lermontov)
- Storm of Steel (Junger)
- The Glass Bees (Junger)
- The Bostonians (James)
- Tarr (Lewis)
- The Chosen (Potock)
- Buddenbrooks (Mann)
- The Magic Mountain (Mann)
