static/~saleh/rbooks.html
<div id="outline-container-org65c3ce2" class="outline-3">
<h3 id="org65c3ce2">On The Zionism Movement and The Israeli Occupation in Palestine</h3>
<div class="outline-text-3" id="text-org65c3ce2">
<ul class="org-ul">
<li>Ethnocracy (Yifachel)</li>
<li>Language They Understand (Thrall)</li>
<li>Invention of Ancient Israel</li>
<li>Gaza in Crisis (Chomsky)</li>
<li>اتفاق أوسلو وتداعياته</li>
<li>الفكر السياسي الفلسطيني 1964-1974</li>
<li>حول التناقض والممارسة في الثورة الفلسطينية]]</li>
<li>ما بعد الصهيونية ومستقبل المجتمع الإسرائيلي</li>
<li>الاقتصاد السياسي لصناعة التقنية العالية في اسرائيل</li>
<li>استراتيجية التحرير الكامل واستراتيجية الحل السياسي</li>
<li>الهيكل التنظيمي للانتفاضة وأساليب العمل ربعي المهدون</li>
<li>شبهات حول الثورة الفلسطينية</li>
<li>الصهيونية غير اليهودية</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org85af969" class="outline-2">
<h2 id="org85af969">Misc Authors</h2>
<div class="outline-text-2" id="text-org85af969">
<ul class="org-ul">
<li>Antony C. Sutton</li>
<li>Immanuel Wallerstein</li>
<li>Gustave Doré</li>
<li>Dante Alighieri</li>
<li>Walter Rodney</li>
</ul>
</div>
</div>
<div id="outline-container-org9b0e4ba" class="outline-2">
<h2 id="org9b0e4ba">Poetry</h2>
<div class="outline-text-2" id="text-org9b0e4ba">
<ul class="org-ul">
<li><del>The Canteos (Pound)</del></li>
<li>Collected Poems (Kipling)</li>
<li>Collected Poems (T.S. Eliot)</li>
<li>Complete Poetry (William Bake)</li>
<li>The Unfortunates (Bear)</li>
</ul>
</div>
</div>
<div id="outline-container-orga0c546e" class="outline-2">
<h2 id="orga0c546e">Politics</h2>
<div class="outline-text-2" id="text-orga0c546e">
<ul class="org-ul">
<li><span class="underline">Propaganda and the Public Mind (Chomsky)</span></li>
<li>The Protestant Ethic (Weber)</li>
<li>The New Age of Empire (Andrews)</li>
<li>Anarchism (Guerin)</li>
<li>Postcapitalist Desire (Fisher)</li>
<li>The Myth of Religious Violence</li>
<li>The Great Delusion (John Mearsheimer)</li>
<li>The Fourth Political Theory</li>
<li>Biology as ideology (Lewontin)</li>
<li>Political Psychology (Houghton)</li>
<li>How Democracies Die (Levitsky)</li>
<li>The Year 501</li>
<li>Soft Power (Nye)</li>
<li>How Fascism Works (Stanley)</li>
<li>Desert (Anonymous)</li>
<li>العلمانية الجزئية والعلمانية الشاملة</li>
<li>الدين والعلمانية في سياق تاريخي</li>
<li>أميركا والإبادات الجماعية</li>
<li>فخ النيوليبرالية في دول الخليج</li>
<li>الطريق إلى التطرف</li>
<li>المثقفون العرب والتراث</li>
<li>المدينة الإسلامية والأصولية والإرهاب</li>
<li>Occupy (Chomsky)</li>
<li>Perilous Power<label for="63" class="margin-toggle sidenote-number"></label><input type="checkbox" id="63" class="margin-toggle"/><span class="sidenote">
The Middle East and US Foreign Policy. Dialogues on Terror, Democracy, War,
and Justice
</span> (Chomsky)</li>
<li>Hegemony or Survival (Chomsky)</li>
<li>Imperial Ambitions (Chomsky)</li>
<li>Pirates and Emperors (Chomsky)</li>
<li>The Leaderless Revolution (Ross)</li>
<li>The China Model<label for="64" class="margin-toggle sidenote-number"></label><input type="checkbox" id="64" class="margin-toggle"/><span class="sidenote">
Political Meritocracy and the Limits of Democracy
</span></li>
<li>The Impossible State<label for="65" class="margin-toggle sidenote-number"></label><input type="checkbox" id="65" class="margin-toggle"/><span class="sidenote">
Islam, Politics, and Modernity&rsquo;s Moral Predicament
</span></li>
<li>تفكيك الإشتراكية العربية</li>
<li>جذور العنصرية العربية</li>
<li>لماذا نكره الإسلام السياسي</li>
<li>Global Culture (Featherstone)</li>
<li>Rogue States (Chomsky)</li>
<li>النبوءة والسياسة</li>
<li>طريق الحرير (فرانكوبان، ب)</li>
<li>Nervous States: Democracy and the Decline of Reason (Davies, W)</li>
</ul>
</div>
</div>
<div id="outline-container-org35ce8f2" class="outline-2">
<h2 id="org35ce8f2">Science-related</h2>
<div class="outline-text-2" id="text-org35ce8f2">
<ul class="org-ul">
<li>Fossils (Thomson)</li>
<li>The Behaviour of the Domestic Cat</li>
<li>In Defence of Dogs (Bradshaw)</li>
<li>The Domestic Cat (Bateson)</li>
<li>كيف ينتشر السلوك؟</li>
<li>The Mismeasure of Man<label for="66" class="margin-toggle sidenote-number"></label><input type="checkbox" id="66" class="margin-toggle"/><span class="sidenote">
Jay Gould
</span></li>
<li>علم النفس مذهبًا (فيتز، ب)</li>
</ul>
</div>
</div>
<div id="outline-container-orgca22369" class="outline-2">
<h2 id="orgca22369">Chess</h2>
<div class="outline-text-2" id="text-orgca22369">
<ul class="org-ul">
<li>Amateur to IM (Hawkins)</li>
<li>Chess for Zebras (Rowson)</li>
<li>Chess Fundamentals (Capablanca)</li>
<li>Judgement and Planning in Chess (Euwe)</li>
<li>Winning with Chess Psychology</li>
<li>Think Like a Grandmaster (Kotov)</li>
<li>Understanding Chess Endgames</li>
</ul>
</div>
</div>
<div id="outline-container-org8ddd7c8" class="outline-2">
<h2 id="org8ddd7c8">Heritage</h2>
<div class="outline-text-2" id="text-org8ddd7c8">
<ul class="org-ul">
<li>تاريخ الحسين</li>
<li>حديقة الحقيقة</li>
<li>تاريخ الزركلي</li>
<li>وفيات الأعيان</li>
<li>تاريخ الرسول والملوك</li>
<li>تاريخ الإسلام</li>
<li>الكامل في التريخ</li>
<li>الطبقات الكبير</li>
<li>سير أعلام النبلاء</li>
<li>مرآة الزمان في تاريخ الأعيان</li>
<li>البستان الجامع</li>
<li>التاريخ المعتبر</li>
</ul>
</div>
</div>
<div id="outline-container-org7252ceb" class="outline-2">
<h2 id="org7252ceb">Aesthetics</h2>
<div class="outline-text-2" id="text-org7252ceb">
<ul class="org-ul">
<li><span class="underline">Culture and Value (Wittgenstein)</span></li>
<li><span class="underline">Esoterism as Principle and as Way</span></li>
<li>شرح نهج البلاغة</li>
<li>الدر الفريد</li>
<li>The Flinch (Smith)</li>
<li>Wisdom for the Soul</li>
<li>التذكرة</li>
<li>قصص العرب</li>
<li>نفح الطيب من غصن الأندلس الرطيب</li>
<li>مقامات الحريري</li>
<li>قول على قول</li>
<li>حلية الأولياء</li>
<li>Joseph de Maistre</li>
<li>Alberto Moravia</li>
<li>Ismail Kadare</li>
<li>Ivan Turgenev</li>
<li>Jonathan Swift</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf19bc5" class="outline-2">
<h2 id="orgaf19bc5">Literature</h2>
<div class="outline-text-2" id="text-orgaf19bc5">
<ul class="org-ul">
<li>The Illuminatus! Trilogy (Wilson, R. and Shea, R.)</li>
<li>Confession (Gorky, M.)</li>
<li>Death with Interruptions (Saramago, J.)</li>
<li>Perfume: The Story of a Murderer (Suskind, P.)</li>
<li>Prljave ruke (Kazantzakis, N.)</li>
<li>Christ Recrucified (Kazantzakis, N.)</li>
<li>Nausea (Sartre, J.-P.)</li>
<li>Growth of the Soil (Hamsun)</li>
<li>جناح السرطان (سولجينيتسين، أ.)</li>
<li>Confessions of a Mask (Mishima, Y.)</li>
<li>A Hero of Our Time (Lermontov)</li>
<li>Storm of Steel (Junger)</li>
<li>The Glass Bees (Junger)</li>
<li>The Bostonians (James)</li>
<li>Tarr (Lewis)</li>
<li>The Chosen (Potock)</li>
<li>Buddenbrooks (Mann)</li>
<li>The Magic Mountain (Mann)</li>
</ul>
</div>
</div>
