static/~saleh/rbooks.html
<div id="outline-container-org8730a10" class="outline-2">
<h2 id="org8730a10">Uncatagorized</h2>
<div class="outline-text-2" id="text-org8730a10">
<ul class="org-ul">
<li><i>Anarchism</i> by Daniel Guerin</li>
<li><i>Anarcho-Syndicalism: Theory and Practice</i> by Rudolf Rocker</li>
<li>Bakunin on Anarchy: Selected Works by the Activist-Founder of World Anarchism</li>
<li><i>Demanding the Impossible: A History of Anarchism</i> by Peter H. Marshall</li>
<li><i>Homage to Catalonia</i> by George Orwell</li>
<li><i>Mutual Aid: A Factor in Evolution</i> by Peter Kropotkin</li>
<li>/The Origins of the Korean War Vol I. &amp; II  by Bruce Cumings<br></li>
<li>/The Battle for Guatemala: Rebels, Death Squads, and U.S. Power  by Susanne Jonas<br></li>
<li>Checkout losing hope (reread)</li>
<li><i>Imperial State and Revolution: The United States and Cuba, 1952-1986</i> by Morris H. Morley</li>
<li>The Horrors of the Half-Known Life: Male Attitudes Toward Women and Sexuality in Nineteenth-Century America</li>
<li><i>The People&rsquo;s Religion: American Faith in the 90&rsquo;s</i> by George Gallup Jr. and Jim Castelli</li>
<li><i>White-Out: The C.I.A., Drugs and the Press</i> by Alexander Cockburn and Jeffrey St. Clair</li>
<li><i>The ABCs of Political Economy * * by Robert Hahnel</i></li>
<li>/Business Organization and the Myth of the Market Economy  by William Lazonick\\ /</li>
<li><i>Business as a System of Power</i> by Robert A. Brady</li>
<li><i>Capitalism and Its Economics: A Critical History</i> by Douglas F. Dowd</li>
<li><i>The Corporation: The Pathological Pursuit of Profit and Power</i> by Joel Bakan</li>
<li>/Corporate Control, Corporate Power  by Edward S. Herman<br></li>
<li><i>Wall Street: How It Works and for Whom</i> by Doug Henwood</li>
<li><i>The Wealth of Nations</i> by Adam Smith</li>
<li><i>No Contest: The Case Against Competition</i> by Alfie Kohn</li>
<li><i>Moral Minds: The Nature of Right and Wrong</i> by Marc D. Hauser</li>
<li>/America by Design: Science, Technology, and the Rise of Corporate Capitalism  by David F. Noble<br></li>
<li><i>Bad Samaritans</i> by Ha-Joon Chang</li>
<li>/Economics and World History: Myths and Paradoxes  by Paul Bairoch<br></li>
<li>/The Bolsheviks and Workers&rsquo; Control, 1917 to 1921  by Maurice Brinton<br></li>
<li>/The End of Empire  by John Strachey<br></li>
<li>/The Unknown Revolution, 1917-1921  by Voline<br></li>
<li>/The Absence of Peace: Understanding the Israeli-Palestinian Conflict  by Nicholas Guyatt<br></li>
<li>/Blaming the Victims: Spurious Scholarship and the Palestinian Question  edited by Christopher Hitchens and Edward Said<br></li>
<li>/The Holocaust Industry: Reflections on the Exploitation of Jewish Suffering  by Norman G. Finkelstein<br></li>
<li><i>Image and Reality of the Israel-Palestine Conflict</i> by Norman G. Finkelstein</li>
<li><i>The Israeli Connection: Who Israel Arms and Why</i> by Benjamin Beit-Hallahmi</li>
<li><i>Israeli Foreign Policy: South Africa and Central America</i> by Jane Hunter</li>
<li>/My Home, My Prison  by  Raymonda Hawa Tawil<br>
/</li>
<li><i>The Rise and Fall of Palestine: A Personal Account of the Intifada Years</i> by Norman G. Finkelstein</li>
<li>/The Third Way: A Journal of Life in the West Bank  by Raja Shehadeh<br>
/</li>
<li><i>The West Bank Story</i> by Rafik Halabi</li>
<li>/Beyond Hypocrisy: Decoding the News in an Age of Propaganda  by Edward S. Herman<br></li>
<li>/The British Press: a Manifesto  edited by James Curran<br></li>
<li>/The Daily Newspaper in America: The Evolution of a Social Instrument  by  Alfred McClung Lee<br></li>
<li>/Inventing Reality: The Politics of the Mass Media  by Michael Parenti<br></li>
<li><i>Propaganda</i> by Edward L. Bernays</li>
<li>/Egypt in the Reign of Muhammad Ali  by  Afaf Lutfi Al-Sayyid Marsot<br></li>
<li>/The Fire This Time: U.S. War Crimes in the Gulf  by Ramsey Clark<br></li>
<li><i>The U.S. Press and Iran: Foreign Policy and the Journalism of Deference</i> by William A. Dorman and Mansour Farhang</li>
<li><i>A Discourse on the Origins of Inequality</i> by Jean-Jacques Rousseau </li>
<li><i>Main Currents of Marxism: Its Rise, Growth, and Dissolution</i> by Leszek Kolakowski</li>
<li><i>The</i> Real <i>Terror Network: Terrorism in Fact and Propaganda</i> by Edward S. Herman</li>
<li><i>Terrorism and the State: A Critique of Domination Through Fear</i> by William D. Perdue</li>
<li><i>Western State Terrorism</i> edited by Alexander George</li>
<li><i>After Such Knowledge, What Forgiveness?</i> by Jonathan C. Randal</li>
<li><i>The American Occupation of Japan: The Origins of the Cold War in Asia</i> by Michael Schaller</li>
<li><i>In Search of Enemies: A C.I.A. Story  by John Stockwell</i></li>
<li><i>Inevitable Revolutions: The United States in Central America  by Walter LaFeber</i></li>
</ul>
</div>
</div>
